## Data Aggregtion and Group Operation

In [1]:
import pandas as pd
import numpy as np

In [3]:
df = pd.DataFrame({'key1' : ['a', 'a', 'b', 'b', 'a'],
    'key2' : ['one', 'two', 'one', 'two', 'one'],
    'data1' : np.random.randn(5),
    'data2' : np.random.randn(5)})

In [4]:
df

      data1     data2 key1 key2
0  1.080886  2.404806    a  one
1 -0.392537  0.810938    a  two
2  1.684569 -0.085758    b  one
3 -1.239409  0.273592    b  two
4 -0.474147  0.956597    a  one

In [5]:
df['sum']=1
df

      data1     data2 key1 key2  sum
0  1.080886  2.404806    a  one    1
1 -0.392537  0.810938    a  two    1
2  1.684569 -0.085758    b  one    1
3 -1.239409  0.273592    b  two    1
4 -0.474147  0.956597    a  one    1

In [6]:
grouped = df['data1'].groupby(df['key1'])

In [11]:
list(grouped)[0]

('a', 0    1.080886
 1   -0.392537
 4   -0.474147
 Name: data1, dtype: float64)

In [12]:
grouped.mean()

key1
a    0.07140
b    0.22258
Name: data1, dtype: float64

In [22]:
means = df['data2'].groupby([df['key1'], df['key2']]).mean()
means

key1  key2
a     one     1.680702
      two     0.810938
b     one    -0.085758
      two     0.273592
Name: data2, dtype: float64

unstack()重建key2索引

In [23]:
means.unstack()

key2       one       two
key1
a     1.680702  0.810938
b    -0.085758  0.273592

In [24]:
states = np.array(['Ohio', 'California', 'California', 'Ohio', 'Ohio'])
years = np.array([2005, 2005, 2006, 2005, 2006])

In [26]:
df['data1'].groupby([states, years]).mean().unstack()

                2005      2006
California -0.392537  1.684569
Ohio       -0.079262 -0.474147

Group 迭代

In [33]:
grouped = df.groupby(df['key1'])
pieces = dict(list(grouped))

In [31]:
for name, group in df.groupby(df['key1']):
    print(name)
    print(group)

a
      data1     data2 key1 key2  sum
0  1.080886  2.404806    a  one    1
1 -0.392537  0.810938    a  two    1
4 -0.474147  0.956597    a  one    1
b
      data1     data2 key1 key2  sum
2  1.684569 -0.085758    b  one    1
3 -1.239409  0.273592    b  two    1

In [35]:
pieces['b']

      data1     data2 key1 key2  sum
2  1.684569 -0.085758    b  one    1
3 -1.239409  0.273592    b  two    1

syntacitc sugar

In [37]:
list(df.groupby('key1')['data1']) # df['data1'].groupby(df['key1'])

[('a', 0    1.080886
  1   -0.392537
  4   -0.474147
  Name: data1, dtype: float64), ('b', 2    1.684569
  3   -1.239409
  Name: data1, dtype: float64)]